Diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>StandardPeriod</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАктов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧДоговораИАкты</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>АктВыполненныхРабот</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы  

&НаКлиенте
Процедура СоздатьАкты(Команда) 
		
	
	ДлительнаяОперация = НачатьВыполнениеНаСервере();
	//@skip-check notify-description-to-server-procedure
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультат", ЭтотОбъект);
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
		
КонецПроцедуры

#КонецОбласти 


#Область СлужебныеПроцедурыИФункции
&НаСервере
Функция ВыполнитьФоновоеЗаданиеНаСервере(ПараметрыЗапуска, УникальныйИдентификатор)
	
	НаименованиеЗадания = "Массовое создание актов";
	
	ВыполняемыйМетод = "ВКМ_МассовоеСозданиеАктов.СоздатьАктыПоДоговорамАбонентскойПлаты";
	
	ПараметрыВыполнения 	= ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	ПараметрыВыполнения.ЗапуститьВФоне 	= Истина;
	ПараметрыВыполнения.Вставить("ИдентификаторФормы", УникальныйИдентификатор); 
	
	СтруктураФоновогоЗадания = ДлительныеОперации.ВыполнитьФункцию(ВыполняемыйМетод, ПараметрыЗапуска, ПараметрыВыполнения);
	
	Возврат СтруктураФоновогоЗадания;
	
КонецФункции 

&НаСервере
Функция НачатьВыполнениеНаСервере() 
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(ЭтаФорма.УникальныйИдентификатор);
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, "ВКМ_МассовоеСозданиеАктов.СоздатьАктыПоДоговорамАбонентскойПлаты", 
	Объект.Период, Объект.ДатаАктов);
	
КонецФункции


// Обработка результата длительной операции "ВКМ_МассовоеСозданиеАктов.СоздатьАктыПоДоговорамАбонентскойПлаты"
&НаСервере
Процедура ОбработатьРезультат(Результат, ДополнительныеПараметры) Экспорт 
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;  
	РезультатФункции = ПолучитьИзВременногоХранилища(Результат.АдресРезультата); 
	
	//Заполняем ТЧОбработки  
	
	Если ЗначениеЗаполнено(РезультатФункции) Тогда
			
		
		Сч = 0;   
		Объект.ТЧДоговораИАкты.Очистить(); 
		
		Для каждого Запись из РезультатФункции Цикл 
			НовСтрока = Объект.ТЧДоговораИАкты.Добавить(); 
			НовСтрока.Договор = Запись.Договор; 
			НовСтрока.АктВыполненныхРабот = Запись.Ссылка;
			Сч = Сч + 1;
		КонецЦикла;  
		
		
		ОбщегоНазначения.СообщитьПользователю("За период: " + ПредставлениеПериода(НачалоМесяца(Объект.ДатаАктов),КонецМесяца(Объект.ДатаАктов),"ФП = Истина") + " количество актов составило " + Сч ); 
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПериодПриИзмененииНаСервере()
	
	Объект.ДатаАктов = Объект.Период.ДатаОкончания;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ПериодПриИзмененииНаСервере(); 
	
КонецПроцедуры


#КонецОбласти
